# Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.

# Пример:
# - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

def input_numbers(inputText):
    Chek = False
    while not Chek:
        try:
            number = int(input(f"{inputText}"))
            Chek = True
        except ValueError:
            print("Это не то! Вводить надо целые числа!")
    return number


def calc_factorial(number):
    factorial = 1
    for i in range(1, number+1):
        factorial *= i
        print(factorial, end=' ')


##---------------------------------------------------------------##

n = input_numbers('Enter the number: ')
calc_factorial(n)