##task001-------------------------------------------------##
# Напишите программу вычисления арифметического выражения
# заданного строкой. Используйте операции +,-,/,*. приоритет
# операций стандартный.
# Пример:2+2 => 4;
#        1+2*3 => 7;
#        1-2*3 => -5;
""" 
expression = input('Введите выражениe: ')
result = eval(expression)
print(f'{expression} = {result}')
 """
##task002-------------------------------------------------##
# Дана последовательность чисел. Получить список уникальных
# элементов заданной последовательности.
# Пример:[1, 2, 3, 5, 1, 5, 3, 10] => [2, 10]

lst = [1, 2, 3, 5, 1, 5, 3, 10]
new_lst = list(filter(lambda x: lst.count(x) == 1, lst))
print(f'{lst} => {new_lst}')
